In [5]:
import pandas as pd
import numpy as np

Series in Pandas

In [6]:
s = pd.Series([10, 20, 30, 40])
print(s)

0    10
1    20
2    30
3    40
dtype: int64

SERIES FROM DICTIONARY

In [7]:
data = {
    "a": 10,
    "b": 20,
    "c": 30
}

s = pd.Series(data)

print(s)

a    10
b    20
c    30
dtype: int64

DataFrames in Pandas

In [8]:
data = {
    "Name": ["Aman", "krish", "karan"],
    "Age": [22, 23, 21],
    "Marks": [85, 90, 88]
}

In [9]:
print(data)

{'Name': ['Aman', 'krish', 'karan'], 'Age': [22, 23, 21], 'Marks': [85, 90, 88]}

In [10]:
type(data)

dict

In [11]:
marks = pd.DataFrame(data)

In [12]:
print(marks)

    Name  Age  Marks
0   Aman   22     85
1  krish   23     90
2  karan   21     88

In [14]:
marks = pd.DataFrame(
    data, 
    index =["Student1", "Student2", "Student3"],
)

In [15]:
print(marks)

           Name  Age  Marks
Student1   Aman   22     85
Student2  krish   23     90
Student3  karan   21     88

In [17]:
marks.set_index("Name", inplace=True) # if we are setting iplace = true it means we are changing the original object itself.

In [18]:
print(marks)

       Age  Marks
Name
Aman    22     85
krish   23     90
karan   21     88

In [20]:

df = pd.DataFrame({
    "Name": ["abc", "xhd", "aks"],
    "Age": [12, 23, 4],
    "Marks": [43, 35, 41]
})

print(df)

  Name  Age  Marks
0  abc   12     43
1  xhd   23     35
2  aks    4     41

In [21]:
df.head() # as the no of rows is less than 5 so the output of both df head and df tail will be identical

  Name  Age  Marks
0  abc   12     43
1  xhd   23     35
2  aks    4     41

In [22]:
df.tail() # as the no of rows is less than 5 so the output of both df head and df tail will be identical

  Name  Age  Marks
0  abc   12     43
1  xhd   23     35
2  aks    4     41

In [23]:
df.describe()

             Age      Marks
count   3.000000   3.000000
mean   13.000000  39.666667
std     9.539392   4.163332
min     4.000000  35.000000
25%     8.000000  38.000000
50%    12.000000  41.000000
75%    17.500000  42.000000
max    23.000000  43.000000